configs/smoke.yaml
# Minimal real-GPU smoke test: 2 instances from different task types,
# 2 instrumented trajectories each plus 1 standard trajectory each = 6 runs.

experiment:
  name: smoke
  seed: 20260731
  output_root: ${BIOMNI_UNC_OUTPUT_ROOT:-./runs}

benchmark:
  dataset: biomni/Eval1
  parquet_uri: hf://datasets/biomni/Eval1/biomni_eval1_dataset.parquet
  local_parquet: ${BIOMNI_UNC_EVAL1_PARQUET:-}
  target_total_instances: 2
  per_task_target: 1
  preferred_split: val
  manifest_seed: 20260731
  # Two contrasting formats: a bare gene symbol and a tagged multiple choice
  # letter. Everything else is excluded so the smoke test stays cheap.
  exclude_tasks:
    - crispr_delivery
    - gwas_causal_gene_gwas_catalog
    - gwas_causal_gene_pharmaprojects
    - gwas_variant_prioritization
    - lab_bench_seqqa
    - patient_gene_detection
    - rare_disease_diagnosis
    - screen_gene_retrieval
  max_prompt_chars: null

model:
  identifier: biomni/Biomni-R0-32B-Preview
  revision: 71432eb3d5e583bee757e0f9437a17e711e8e3d1
  source: Custom
  temperature: 0.7
  max_tokens: 8192
  request_timeout_seconds: 1800
  context_length: 65536
  dtype: bfloat16
  json_model_override_args: '{"rope_scaling":{"rope_type":"yarn","factor":1.0,"original_max_position_embeddings":32768}, "max_position_embeddings": 131072}'
  request_seed_enabled: true

confidence:
  mode: final_only
  open_delimiter: "<BIOMNI_CONFIDENCE>"
  close_delimiter: "</BIOMNI_CONFIDENCE>"
  epsilon: 0.001

trajectories:
  instrumented_k: 2
  standard_k: 1
  seed_base: 1000

execution:
  max_concurrency: 2
  run_timeout_seconds: 1800
  tool_timeout_seconds: 300
  scratch_root: ${BIOMNI_UNC_SCRATCH:-/tmp/biomni_unc_scratch}
  data_path: ${BIOMNI_PATH:-./biomni_data_root}
  use_tool_retriever: true
  retry_policy:
    max_attempts: 1
    retryable_failure_classes: []
    backoff_seconds: 10.0

logging:
  stdout_limit: 4000
  stderr_limit: 4000
  max_event_payload_chars: 20000

analysis:
  bootstrap_replicates: 200
  bootstrap_seed: 20260731
  calibration_bins: 3
  primary_length_field: total_output_tokens
  binary_reward_threshold: 0.5
  srlm_epsilon: 0.001